# Core dotfiles dependencies (run: brew bundle --file=~/dotfiles/Brewfile)
tap "felixkratz/formulae"

brew "bat"
brew "eza"
brew "fish"
brew "fzf"
brew "gh"
brew "ghq"
brew "lazygit"
brew "mise"
brew "ripgrep"
brew "skhd"
brew "starship"
brew "tmux"
brew "yabai"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"

cask "karabiner-elements"
cask "wezterm"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
